
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "58dbcdad1e3b76b38d2cb861677df37f" -> "00f1cabdbfce3e8c98cad51c9a63ed3b" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "template.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":746,"Program":"tfcmt","SHA1":"","Vars":{}} -->